---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasCustomAxis
source: html/c40ae541-f0bc-fc8d-3fa8-5a40a5183d34.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasCustomAxis Property

Identifies if the data contains a custom extrusion axis.

## Syntax (C#)
```csharp
public bool HasCustomAxis { get; }
```